socialNetwork/wrk2/outs/c500_r2000.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 500 connections
  Thread calibration: mean lat.: 130.961ms, rate sampling interval: 454ms
  Thread calibration: mean lat.: 139.712ms, rate sampling interval: 507ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.08s     1.38s    6.32s    86.81%
    Req/Sec     0.98k   163.39     1.28k    76.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  481.79ms
 75.000%    1.51s 
 90.000%    2.88s 
 99.000%    6.32s 
 99.900%    9.99s 
 99.990%   12.17s 
 99.999%   12.66s 
100.000%   12.71s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.998     0.000000            1         1.00
      80.767     0.100000         9733         1.11
     120.895     0.200000        19463         1.25
     179.199     0.300000        29190         1.43
     280.831     0.400000        38922         1.67
     481.791     0.500000        48651         2.00
     651.263     0.550000        53515         2.22
     856.063     0.600000        58381         2.50
    1065.983     0.650000        63266         2.86
    1255.423     0.700000        68107         3.33
    1505.279     0.750000        72973         4.00
    1657.855     0.775000        75413         4.44
    1844.223     0.800000        77838         5.00
    2055.167     0.825000        80273         5.71
    2281.471     0.850000        82711         6.67
    2547.711     0.875000        85130         8.00
    2705.407     0.887500        86359         8.89
    2879.487     0.900000        87568        10.00
    3088.383     0.912500        88779        11.43
    3311.615     0.925000        89995        13.33
    3567.615     0.937500        91217        16.00
    3727.359     0.943750        91821        17.78
    3891.199     0.950000        92433        20.00
    4071.423     0.956250        93035        22.86
    4276.223     0.962500        93643        26.67
    4558.847     0.968750        94251        32.00
    4730.879     0.971875        94556        35.56
    4894.719     0.975000        94863        40.00
    5087.231     0.978125        95163        45.71
    5369.855     0.981250        95473        53.33
    5697.535     0.984375        95775        64.00
    5865.471     0.985938        95927        71.11
    6017.023     0.987500        96076        80.00
    6180.863     0.989062        96227        91.43
    6434.815     0.990625        96380       106.67
    6733.823     0.992188        96531       128.00
    6873.087     0.992969        96608       142.22
    7069.695     0.993750        96683       160.00
    7323.647     0.994531        96759       182.86
    7581.695     0.995313        96837       213.33
    7860.223     0.996094        96912       256.00
    7966.719     0.996484        96950       284.44
    8105.983     0.996875        96987       320.00
    8380.415     0.997266        97025       365.71
    8585.215     0.997656        97066       426.67
    8822.783     0.998047        97101       512.00
    9011.199     0.998242        97120       568.89
    9240.575     0.998437        97139       640.00
    9510.911     0.998633        97159       731.43
    9838.591     0.998828        97177       853.33
   10002.431     0.999023        97197      1024.00
   10125.311     0.999121        97206      1137.78
   10239.999     0.999219        97215      1280.00
   10493.951     0.999316        97225      1462.86
   10633.215     0.999414        97234      1706.67
   10903.551     0.999512        97244      2048.00
   11042.815     0.999561        97249      2275.56
   11108.351     0.999609        97254      2560.00
   11141.119     0.999658        97258      2925.71
   11304.959     0.999707        97263      3413.33
   11649.023     0.999756        97268      4096.00
   11714.559     0.999780        97270      4551.11
   11829.247     0.999805        97272      5120.00
   11862.015     0.999829        97275      5851.43
   11878.399     0.999854        97277      6826.67
   11993.087     0.999878        97280      8192.00
   12165.119     0.999890        97281      9102.22
   12271.615     0.999902        97282     10240.00
   12402.687     0.999915        97283     11702.86
   12443.647     0.999927        97284     13653.33
   12509.183     0.999939        97286     16384.00
   12509.183     0.999945        97286     18204.44
   12558.335     0.999951        97288     20480.00
   12558.335     0.999957        97288     23405.71
   12558.335     0.999963        97288     27306.67
   12648.447     0.999969        97289     32768.00
   12648.447     0.999973        97289     36408.89
   12648.447     0.999976        97289     40960.00
   12648.447     0.999979        97289     46811.43
   12656.639     0.999982        97290     54613.33
   12656.639     0.999985        97290     65536.00
   12656.639     0.999986        97290     72817.78
   12656.639     0.999988        97290     81920.00
   12656.639     0.999989        97290     93622.86
   12705.791     0.999991        97291    109226.67
   12705.791     1.000000        97291          inf
#[Mean    =     1079.994, StdDeviation   =     1383.758]
#[Max     =    12697.600, Total count    =        97291]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  117008 requests in 1.00m, 28.87MB read
  Socket errors: connect 0, read 0, write 0, timeout 5
  Non-2xx or 3xx responses: 117008
Requests/sec:   1950.20
Transfer/sec:    492.82KB