socialNetwork/wrk2/outs/c500_r250.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 500 connections
  Thread calibration: mean lat.: 2.928ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.952ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.02ms    1.41ms   8.81ms   90.45%
    Req/Sec   131.09    117.19   444.00     57.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.60ms
 75.000%    3.24ms
 90.000%    4.33ms
 99.000%    8.81ms
 99.900%   16.09ms
 99.990%   24.11ms
 99.999%   24.21ms
100.000%   24.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.235     0.000000            1         1.00
       2.069     0.100000         1238         1.11
       2.215     0.200000         2482         1.25
       2.333     0.300000         3717         1.43
       2.453     0.400000         4956         1.67
       2.599     0.500000         6191         2.00
       2.697     0.550000         6812         2.22
       2.813     0.600000         7433         2.50
       2.925     0.650000         8052         2.86
       3.073     0.700000         8673         3.33
       3.241     0.750000         9284         4.00
       3.357     0.775000         9596         4.44
       3.503     0.800000         9908         5.00
       3.651     0.825000        10216         5.71
       3.827     0.850000        10522         6.67
       4.057     0.875000        10832         8.00
       4.207     0.887500        10987         8.89
       4.327     0.900000        11143        10.00
       4.519     0.912500        11296        11.43
       4.747     0.925000        11450        13.33
       5.023     0.937500        11604        16.00
       5.211     0.943750        11681        17.78
       5.379     0.950000        11759        20.00
       5.619     0.956250        11837        22.86
       5.891     0.962500        11913        26.67
       6.207     0.968750        11991        32.00
       6.351     0.971875        12029        35.56
       6.575     0.975000        12068        40.00
       6.815     0.978125        12107        45.71
       7.131     0.981250        12146        53.33
       7.471     0.984375        12184        64.00
       7.635     0.985938        12203        71.11
       8.111     0.987500        12223        80.00
       8.463     0.989062        12242        91.43
       8.983     0.990625        12262       106.67
       9.591     0.992188        12281       128.00
      10.079     0.992969        12290       142.22
      10.527     0.993750        12300       160.00
      10.967     0.994531        12310       182.86
      11.279     0.995313        12319       213.33
      11.583     0.996094        12329       256.00
      11.903     0.996484        12334       284.44
      12.431     0.996875        12339       320.00
      12.855     0.997266        12344       365.71
      13.207     0.997656        12348       426.67
      13.799     0.998047        12353       512.00
      14.431     0.998242        12356       568.89
      14.647     0.998437        12358       640.00
      15.263     0.998633        12361       731.43
      15.943     0.998828        12363       853.33
      16.087     0.999023        12365      1024.00
      16.239     0.999121        12367      1137.78
      16.431     0.999219        12368      1280.00
      18.463     0.999316        12369      1462.86
      18.607     0.999414        12370      1706.67
      20.751     0.999512        12371      2048.00
      20.895     0.999561        12372      2275.56
      21.247     0.999609        12373      2560.00
      21.247     0.999658        12373      2925.71
      21.439     0.999707        12374      3413.33
      21.439     0.999756        12374      4096.00
      22.095     0.999780        12375      4551.11
      22.095     0.999805        12375      5120.00
      22.095     0.999829        12375      5851.43
      24.111     0.999854        12376      6826.67
      24.111     0.999878        12376      8192.00
      24.111     0.999890        12376      9102.22
      24.111     0.999902        12376     10240.00
      24.111     0.999915        12376     11702.86
      24.207     0.999927        12377     13653.33
      24.207     1.000000        12377          inf
#[Mean    =        3.020, StdDeviation   =        1.415]
#[Max     =       24.192, Total count    =        12377]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14897 requests in 1.00m, 3.67MB read
  Socket errors: connect 0, read 0, write 0, timeout 5317
  Non-2xx or 3xx responses: 14897
Requests/sec:    248.27
Transfer/sec:     62.67KB