socialNetwork/wrk2/outs/c50_r10.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 50 connections
  Thread calibration: mean lat.: 3.859ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.753ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.12ms  738.16us   5.45ms   84.24%
    Req/Sec     5.59     23.53   111.00     94.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.94ms
 75.000%    3.36ms
 90.000%    3.91ms
 99.000%    5.45ms
 99.900%    8.09ms
 99.990%   10.25ms
 99.999%   10.25ms
100.000%   10.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.799     0.000000            1         1.00
       2.475     0.100000           54         1.11
       2.623     0.200000          109         1.25
       2.723     0.300000          161         1.43
       2.831     0.400000          216         1.67
       2.941     0.500000          267         2.00
       3.015     0.550000          297         2.22
       3.097     0.600000          320         2.50
       3.175     0.650000          347         2.86
       3.281     0.700000          374         3.33
       3.363     0.750000          400         4.00
       3.427     0.775000          414         4.44
       3.501     0.800000          428         5.00
       3.549     0.825000          440         5.71
       3.617     0.850000          454         6.67
       3.747     0.875000          467         8.00
       3.825     0.887500          474         8.89
       3.907     0.900000          480        10.00
       4.013     0.912500          488        11.43
       4.131     0.925000          494        13.33
       4.183     0.937500          500        16.00
       4.275     0.943750          504        17.78
       4.379     0.950000          507        20.00
       4.439     0.956250          510        22.86
       4.575     0.962500          514        26.67
       4.699     0.968750          517        32.00
       4.751     0.971875          519        35.56
       4.827     0.975000          520        40.00
       4.923     0.978125          522        45.71
       4.983     0.981250          524        53.33
       5.119     0.984375          525        64.00
       5.155     0.985938          526        71.11
       5.295     0.987500          527        80.00
       5.451     0.989062          528        91.43
       5.975     0.990625          529       106.67
       5.975     0.992188          529       128.00
       6.067     0.992969          530       142.22
       6.067     0.993750          530       160.00
       7.735     0.994531          531       182.86
       7.735     0.995313          531       213.33
       7.735     0.996094          531       256.00
       8.087     0.996484          532       284.44
       8.087     0.996875          532       320.00
       8.087     0.997266          532       365.71
       8.087     0.997656          532       426.67
       8.087     0.998047          532       512.00
      10.247     0.998242          533       568.89
      10.247     1.000000          533          inf
#[Mean    =        3.118, StdDeviation   =        0.738]
#[Max     =       10.240, Total count    =          533]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  647 requests in 1.00m, 163.12KB read
  Socket errors: connect 0, read 0, write 0, timeout 961
  Non-2xx or 3xx responses: 647
Requests/sec:     10.78
Transfer/sec:      2.72KB